
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.comet_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-2.amazonaws.com/id/CC75DDC734F3725219E784313146E5CF"
    }

  # module.comet_eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/comet-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/eks/comet-eks/cluster"
        }
      + tags_all          = {
          + "Name"        = "/aws/eks/comet-eks/cluster"
          + "environment" = "Production"
          + "managed_by"  = "terraform"
          + "owner"       = "Bazit Adebiyi"
          + "project"     = "Comet"
        }
    }

  # module.comet_eks.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "comet-eks"
        name                          = "comet-eks"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ]
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.comet_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::690893780650:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/CC75DDC734F3725219E784313146E5CF"
        tags            = {
            "Name" = "comet-eks-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-2:690893780650:nodegroup/comet-eks/comet-eks-default-20250718221327601600000003/9ecc0fcc-baf0-c2b3-0ac0-8203e60f5d58" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "comet-eks:comet-eks-default-20250718221327601600000003" -> (known after apply)
      ~ node_group_name        = "comet-eks-default-20250718221327601600000003" -> (known after apply)
      ~ release_version        = "1.32.3-20250715" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "comet-eks-default"
        }
        # (9 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-05d6857f242763f62"
          ~ name    = "comet-eks-default-lt-20250718221321970200000001" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-05d6857f242763f62"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "comet-eks-default-lt-20250718221321970200000001"
        tags                    = {
            "Name" = "comet-ng"
        }
      ~ vpc_security_group_ids  = [
          - "sg-032aaedb5a040d54e",
        ]
        # (8 unchanged attributes hidden)

      + network_interfaces {
          + associate_public_ip_address = "false"
          + security_groups             = [
              + "sg-032aaedb5a040d54e",
            ]
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

<!-- Sticky Pull Request Comment -->